Revit 2027 API
BuiltInFailures.RoofFailures.UserCancelledRoof Property
 Cancelled.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId UserCancelledRoof { get; }
Public Shared ReadOnly Property UserCancelledRoof As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ UserCancelledRoof {
	FailureDefinitionId^ get ();
}
static member UserCancelledRoof : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RoofFailures Class
Autodesk.Revit.DB Namespace